CHAPTER1：追逐希望的逃亡者（希望を手に追われる者）

BATTLE FIELD-01 盗贼の砦（盗贼山寨）
胜利条件:::敌全灭######
失败条件:::米拉诺（ミラノ）战死######
我方配置:::米拉诺，柯布恩（不可变更）######
可选择卡片数:::5（全部）######
body:::3个敌人都很容易解决，女武神艾基娜（アイギナ）虽然武器克制男主角米拉诺，但是米拉诺（ミラノ）和其同伴柯布恩占据有利的地形，并且本章强制我方胜利。战斗结束后得到卡片革命之战（レヴオリユーシヨン）。与女主角尤古朵拉（ユグドラ）对话后得到卡片破邪之光（バニッシユ）和死者复生（サンクチュアリ）。######
隐藏道具:::移动到地图左上角可以得到道具：发圈（カチコーシャ[*建议保留*]）。######
敌人装备:::铁颈环（鉄のチョーカー[艾基娜装备]）。######
我方默认装备:::银月（シルヴァームーン[米拉诺装备]），绢丝外套（公主装备）兽皮披风（柯布恩装备）######
我方卡片:::疾盗之影（スティール[米拉诺专用]），心之逆转（マインドチェンジ），净化之光（リフレッシュメンド），海市蜃楼（ミラージュ），巨石天袭（ロックフォール）######

BATTLE FIELD-02 狼の口（狼之口）
胜利条件:::伊恩萨基（インサーギ）击破/全员到达狼の口######
失败条件:::米拉诺（ミラノ）或尤古朵拉（ユグドラ）战死######
我方配置:::米拉诺，尤古朵拉（全员），尤古朵拉拿下MVP +LUK或TEC######
可选择卡片数:::8（全部）######
body:::公主尤古朵拉正式加入，初期LV只有1，能力较差所以要好好培养。战斗结束后胜利条件变更，左方出现帝国将军里昂（レオン）率领的骑兵队的追兵。此处战斗必败，只要逃到右上角的旗帜处就能结束战斗。
成功突破山谷后，狮鹫骑士基莉艾（キリエ）将谷口炸掉，阻拦了敌人骑兵队的继续追击。
东南的集落（贼窝），让米拉诺访问可以掠夺到毛皮。######
通关入手卡片:::妖精之泣（バンシーズクライ）######
敌人装备:::皮の帽子（伊恩萨基[インサーギ]装备）######
我方默认装备:::血玫瑰（ブラッディローズ[基莉艾永久装备]）######

BATTLE FIELD-03 オーランド西部（奥兰多西部）
胜利条件:::全员与骑士杜兰（デュラン）邻接/全部敌人击破/女武神艾基娜（アイギナ）击破######
失败条件:::米拉诺（ミラノ），尤古朵拉（ユグドラ）或骑士杜兰（デュラン）战死######
我方配置:::米拉诺+尤古朵拉（全员），杜兰拿下MVP +LUK######
可选择卡片数:::9（全部）######
body:::将米拉诺和公主尤古朵拉移动到骑士杜兰（デュラン）身边（绿色角色）就会结束上半部分的战斗，杜兰装备圣骑士之枪，并没有生命危险，敌人会主动过去送死。而骑兵克制尤古朵拉，佣兵克制米拉诺，所以对付他们并不轻松，左下的骑兵士气不能降为0，即不可击破。
合流成功后获得王者之护（エースガード）。
合流后进入第2部分，胜利条件变更为敌全灭。带有勋章的那个骑兵为守卫队长，击破队长则部队全灭。
开始时杜兰上方一格能得到道具可可利果实（ココリの実）。再往左2格发现捕兽夹（トラッブ）[*建议保留*]。现在开始可以使用连携攻击了，只要发动攻击的人自身范围有队员就会自动参与连携攻击，当然敌人也会使用。
击破1部队后来到下方的游牧民集落，将先前得到的毛皮制作成毛皮大衣（毛皮のコート）。
西边是魔女单位，注意他们克制我方所有人，最好能一次战斗解决掉魔女方的首领尤蒂（ユーデイ），如果轮到她攻击的话我方多半要损失士气。
敌全灭后，女武神艾基娜（アイギナ）的队伍又出现在左上方。艾基娜的攻击不高，即使是米拉诺攻击她们也多半能胜利，但是考虑艾基娜攻击时，米拉诺的不利会被扩大，所以还是以杜兰和尤古朵拉为主攻。
（*注意，在没有道具的情况下，骑士杜兰是我方唯一能够穿过敌人的队伍到达目的地的队员[基莉艾和以后出现的黑蔷薇在夜晚也可以]，如果陷入人海战而拿不到位于敌人内部的隐藏道具时，可以让杜兰去拿。不过敌方的骑士一般不会进入我方包围圈*）######
通关入手卡片:::地狱业火（フレイム）######
敌人装备:::红宝石之杖（ルビースタッフ[尤蒂装备]），焰形剑（フランベルジェ[艾基娜装备]）######
我方默认装备:::圣骑士之枪（パラディンランス[杜兰装备]）######


BATTLE FIELD-04 オーランド东部（奥兰多东部）
胜利条件:::要塞占领（一共有三个）######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::全员，杜兰拿下MVP +LUK######
可选择卡片数:::8######
body:::隐藏道具四叶幸运草（四叶のクローバー）位置为草原随机，一开始就让尤古朵拉去拿吧，有可能的位置是一开始桥左二格，右下集落右上两内格。要塞左上角一格（守卫队长上方）有帝国兵法书天ノ卷。
突击对方的3个要塞，每个都是一个骑兵首领带3个部下，首领是骑士，一定不要让尤古朵拉与之战斗，尤其是他们还占领了有利的地形。第1个要塞杂兵是剑士，这里要以骑兵为主力战斗，尤古朵拉因为没有优势，如果被他们连携攻击一次的话，可能会被打掉上千士气。
击破守卫队长得到勋章（メダリオン）。以后基本击破队长都能得到勋章。
第2个要塞的敌人是持斧的战士，这里尤古朵拉就非常有利了，所以尽量让她多赚经验值，不过杜兰的不利并不明显。所以第2个要塞是比较容易的。
要塞右下角一格有帝国兵法书地ノ卷。击破守卫队长得到勋章（メダリオン）。
第3个要塞的杂兵是猎人，与猎人对战时被突击方无法反击，并且猎人本身除了白天有利也没有什么优势，除了占据有利地形外，没什么特点，所有人都能轻松击破。但还是要注意不要让他们主动攻击尤古朵拉（虽说武器有优势，可级别不够啊）。
要塞右上角一格有帝国兵法书人ノ卷，左边的游牧民集落可以得到白山羊奶（白山羊のミルク）。白山羊奶喝了之后会成为玻璃瓶（グラスのビン），久不喝会变成白山羊奶酪（白山羊のチーズ）######

CHAPTER2：失落的日子（失われた日々）

BATTLE FIELD-05 ロルカ湖畔（罗尔卡湖畔）
胜利条件:::伊西奴（イシーヌ）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::全员，米拉诺拿下MVP +GEN######
可选择卡片数:::7######
body:::杜兰装备白山羊奶（如果要收集道具的话，可以等变成白山羊奶酪再吃）。
本章敌人全部是水之民温蒂妮，使用武器是枪，在水中地形有很大的优势，本战几乎全靠米拉诺，杜兰不占据有利地形的情况下被攻击基本必败。
伊西奴（イシーヌ）的3个手下都有勋章。寒冰标枪（アイスジャベリン）。######
通关入手卡片:::寒冰风暴（ブリザード）[温蒂妮使用会变为钻石星辰]######
敌人装备:::寒冰标枪（アイスジャベリン[伊西奴装备]）######

BATTLE FIELD-06 フェリナス湖畔（菲利纳斯湖畔）
胜利条件:::湖畔城市维拉斯小镇（町ヴェラス）解放/击破希尔维亚（シルウィーア）暗杀部队######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::全员，尤古朵拉拿下MVP +LUK######
可选择卡片数:::8######
body:::来到地图左下方会使地图扩大：访问下方都市有水之民妮澈（ニーチェ）的加入（妮澈装备武器）
都市上方2格有道具：治愈药草（愈しのハーブ）
第1回合如果不进入集落的话就会被下方的奥鲁提加山贼团破坏，所以一开始就要让杜兰站在集落上。敌人分2部队，所以温蒂妮（人鱼）一队和盗贼一队一回合能分别攻击2次，一定要事先确定队型，尤古朵拉被人鱼攻击多半是会失败的。而妮澈也很难敌过同胞，尽量不要让她对上温蒂妮，让她去打盗贼吧。
战斗结束后右方出现敌人暗杀部队4人，胜利条件变更，这之前不要把米拉诺放在右边，敌人多数用剑。######
通关入手卡片:::血之利爪（ブラッディクロー）######
敌人装备:::必杀之刃（キルブレード[贼王奥鲁提加装备]），钢之面具（钢のペルソナ[暗杀者希尔维亚（シルウィーア）装备]），疾风の弓（暗杀者艾蕾娜[エレナ]装备），刚开战时三个温蒂妮都有勋章。######
我方默认装备:::珊瑚之枪（珊瑚のスピア，妮澈装备，水边地形恢复士气）######

BATTLE FIELD-07 水の都エリーゼ（水之都艾利泽）
胜利条件:::架起弗罗兰岛的架桥（フローランドへ桥到达）/水之女王艾美罗内（エメローネ）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::全员，杜兰拿下MVP +LUK（这一关妮澈不太可能拿下MVP）######
可选择卡片数:::9######
body:::本章开始能使用必杀技。
敌人使用必杀会冻结水面，使所有人都能在水上行走，但是一旦冰面消失，原本不能进入水地形的队伍就会直接战败。而一旦敌人使用了这个必杀，原本对她们有利的水地形将变成-10%的冰面，所以敌人数目虽多但是并不难对付。头疼的是尤古朵拉的武器被克制所以一直郁闷的无法参战，好在本章开始可以使用必杀，可以将她放在连携攻击的最后以便使用必杀扭转不利的局面。而妮澈依然很难打败同胞，没有把握的话最好不要让她参战。
伊西奴要尽快击破，她身上携带的装备勇气戒指（ブレイヴリング）会在劣势情况下恢复士气。
架桥成功后胜利条件变更为女王艾美罗内（エメローネ）击破。顺序应该按照堵路的，女王左下2个，最后女王和女王右边的。这样才能去拿到3个隐藏道具。
几回合后左方会出现敌人增援2个：赏金猎人米泽尔（ミゼル[弓战士]）和一个斧战士。他不会拼到底，可以派人去桥头连携堵住他们不要让他们打扰右方战场，顺利的话很快他们就会撤退。他基本上是不会丢下装备的，如果能在一回合里一战不败地彻底击败他，得到他装备的几率就很大，或者用偷窃。######
隐藏道具:::地图右边最下方（BOSS艾美罗内下3格）有隐藏道具香气薄荷（エレミナミント[*建议保留*]）；艾美罗内下1格，左2格-水瓶座的祝福（アクエリアス）、艾美罗内下1格，右2格-漂亮的贝壳（きれいな贝壳[*建议保留*]）。注意水面冻结的时候是拿不到道具的。######
通关入手卡片:::电光之箭（サンダーボルト）######
敌人装备:::飞翼旅鞋（羽根付きサンダル[米泽尔装备]），勇气戒指（ブレイヴリング[伊西奴装备]），悠久的昆古尼尔（悠久のグングニル[艾美罗内装备，LUK高时会成为战利品，不然就要用盗窃的了……]）######

BATTLE FIELD-08 黒蔷薇领
胜利条件:::全部石头人击破/魔剑士拉塞尔（ラッセル）击破######
失败条件:::米拉诺，尤古朵拉，黑蔷薇领主罗斯威尔（ロズウェル）战死######
我方配置:::全员，妮澈拿下MVP +GEN######
可选择卡片数:::8######
body:::注意米拉诺和尤古朵拉的道具都会在本章损坏，要先装备一些道具。
敌人石头人会破坏集落，所以一开始就要用上移动力最高的卡片。妮澈在后半部分起作用大，主攻。尤古朵拉先天对石头人有优势，所以要让她作为第二主攻。
几回合后上一章的赏金猎人米泽尔再次出现。对战在两回合内解决就不会碰到他。
2只石头人全击破后敌人增援出现，同时，胜利条件变更为击破五龙将之一的魔剑士拉塞尔。这时候再去访问救下的村庄可以获得魔法戒（マージリング[黑蔷薇的法师领主罗斯威尔专用]）和探测杖（ダウジングロッド）。TNV低于8时为幻惑之笛（まやかしの笛）
几回合后，黑蔷薇方发动魔炮，敌人全员受到打击，士气降低。
魔剑士拉塞尔（ラッセル）并不强，先清完杂兵，拉塞尔估计也被轰了几炮了，让妮澈去对付他。######
通关入手卡片:::傀儡制造（メイクドール）&武装破除（アイテムブレイク）。######
敌人装备:::斩鉄剣（拉塞尔装备），幸运扫帚（罗莎莉装备）。如果取得了上一章米泽尔的装备，那么这次他会装备丈夫な长靴（结实的长筒靴）登场（他几乎所有的装备都是靴子）。下面就以每次都取得他的装备为准，否则装备不同。######

BATTLE FIELD-09 白蔷薇领
胜利条件:::石巨人破坏架桥成功/黑骑士里昂（レオン）击破######
失败条件:::米拉诺，尤古朵拉战死，罗莎莉（ロザリィ），石巨人战死，敌人骷髅渡过河。######
我方配置:::全员 ，尤古朵拉拿下MVP +ATK######
可选择卡片数:::8######
body:::几回合后米泽尔2人组再次出现（派经验值较低的队员用强力卡一回合干掉他！）。
占领桥头使敌人骷髅无法渡过河，然后逐个击破就好了，等石巨人挪过来再让开让它破坏。不过注意石巨人靠近架桥的时候就要挪开不要挡住它了。
黑蔷薇罗斯威尔（ロズウェル）士气不会降低为0，击破骷髅后就直接进行下一段就好了。
全部桥击破后敌人骑士团出现，要防止他们的突击，同时胜利条件变更为黑骑士里昂（レオン）击破。同时罗斯威尔变成可以击破的单位。与上一章相似，本章中途白蔷薇方也会使用魔炮攻击对方，等里昂过来的时候，估计也被轰了N炮了。######
通关入手卡片:::冥府之门（ネクロゲート）钢铁战车（チャリオシト）######
敌人装备:::石像怪之杖（ガーゴイルロッド[罗斯威尔装备]），方阵快枪（ファランクス[里昂装备]），突击长靴（レンジャーブーツ[米泽尔装备]）######

BATTLE FIELD-10 ヴァーレンヒルズ（瓦连希鲁兹）
胜利条件:::中立都市玛维鲁（マーヴェル）解放/罗斯威尔（ロスウエル）或罗莎莉（ロザリイ）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::全员，尤古朵拉拿下MVP +GEN######
可选择卡片数:::12######
body:::前几章出现过的佣兵伊恩萨基（インサーギ）和贼老大奥鲁提加又出现了，既然是用斧的，就交给两位主角吧，用枪的还是一旁看着。都市左下的是商店，店主只有晚上才开门。让妮澈去，用贝壳换她专用的防具贝壳胸甲。解放都市后，与2边的蔷薇的任一边开战。
右上BOSS罗斯威尔左4格处有隐藏道具黑曜石，左下白蔷薇处，上方架桥上2格（水中）有魔水晶。
注意敌人会启动魔炮，左下右上都有红色范围表示，进入会遭到炮击损伤士气。
左下的白蔷薇方的石巨人会破坏架桥，所以比较难对付，而右上的骷髅在白天没有战斗力，可以很轻易解决。罗斯威尔是死灵法师，黑暗攻击力UP，且夜晚能瞬移，在对付BOSS级人物的时候能起到很大的作用。而罗莎莉是魔女，火焰攻击无效，攻击力低但LUK很高，由于杖的优势所以清扫杂兵比较在行。这两者都很难敌过同职业的敌人。
白蔷薇和黑蔷薇，只要有一方被击破就会结束战斗。######
通关入手卡片:::毒之吐息（ポイズブレス[黑蔷薇]）或大地崩裂（アースクウェイク[白蔷薇]）######
敌人装备:::安全帽（ヘッドギア[伊恩萨基装备]），狂暴凶刃（凶刃ベルセルク[奥鲁提加装备]），花边饰带（ふりふりレース[罗莎莉装备]），午夜长袍（暗夜のローブ[罗斯威尔装备]）（此处2个道具均要在上2战分别得到过黑白蔷薇的装备才行）######


BATTLE FIELD-10 分支路线：击破白蔷薇进入A路线，击破黑蔷薇进入B路线
胜利条件:::援护蔷薇领主，我方任意一人与之邻接/蔷薇馆夺还######
失败条件:::米拉诺，尤古朵拉战死，蔷薇领主战死######
我方配置:::米拉诺，尤古朵拉+1人，妮澈拿下MVP +LUK######
可选择卡片数:::10######


Battle Field-11 A 黒蔷薇领
胜利条件:::救出罗斯威尔之后胜利条件变更为黑蔷薇馆夺还。######
body:::敌人是用枪的黑骑士里昂。在这两支线路中，左上角都有敌人增援部队，2个女武神以及6章出现的暗杀部队2人（希尔维亚和艾蕾娜）。
TNV高于10时用魔水晶可以在中间集落换水晶权杖（クリスタルロッド）。战斗结束后与罗斯威尔进行对话得到新卡片毒之吐息（ポイズブレス）并且他正式加入队伍。######
敌人装备:::魔枪布拉斯恩多（ブラッェンド[黑骑士里昂装备]）；泰迪熊宝宝（クマのぬいぐるみ[艾米莉奥（エミリオ）装备]）；杀意之假面（杀意の仮面[艾蕾娜（エレナ）装备]），雷殛弓（ライトニングボウ[希尔维亚（シルウィーア）装备]）。######

BATTLE FIELD-11 B 白蔷薇领
胜利条件:::援护罗莎莉（ロザリィ）我方任意一人与之邻接/白蔷薇馆夺还######
敌人是用剑的魔剑士拉塞尔（ラッセル）。本章我方只有1人的任意出场名额，为了拿黑色刻印（ブラックブランド）一定要让人鱼妮澈上场。敌人持有的卡片是会破坏装备道具的[武装破除]，遇到剑士类敌人一定要小心。幸好要求TEC高与我方的GEN。本章一般只有拉塞尔有机会破坏道具，所以要特别小心，不要让他积攒满必杀槽。
开战之前，上一章得到的黑曜石可以让妮澈在左上的魔女の里制作成黑色刻印（ブラックブランド）。救出罗莎莉之后胜利条件变更为白蔷薇馆夺还。
战斗结束后与罗莎莉对话得到新卡片大地崩裂（アースクウェイク）并且她正式加入队伍。

敌人装备:::泰迪熊宝宝（クマのぬいぐるみ[艾米莉奥装备]），杀戮面具（杀意の仮面[希尔维亚（シルウィーア）装备]），雷殛弓（ライトニングボウ[艾蕾娜（エレナ）]装备]），真•斩鉄剣（拉塞尔装备）。######

CHAPTER3：巴鲁提亚电击战（パルティナ电击戦）

BATTLE FIELD-12 山贼の砦（山贼城寨）
胜利条件:::贼王奥鲁提加（オルテカ）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+2人，米拉诺拿下MVP +ATK######
可选择卡片数:::11######
body:::几回合后，右边又出现让人无语的赏金猎人2人组。他们已经有了点道具提供商的味道了，解决掉他吧，他会在士气低于一定数值的时候撤退。建议打退他再调头打奥鲁提加。
贼王奥鲁提加右上，其连携攻击范围内有一台投石机，注意在他进攻回合时投石机会率先攻击。先利用他附近的杂兵连携BOSS，消耗他的士气，最后在围攻奥鲁提加时，除用枪的角色外都能很轻松取胜。
击破贼王后奥鲁提加战死。######
隐藏道具:::开始我方最左下人物向左2格的河流中：佑普拉雕像（ウポラ像[使用后成为破碎的佑普拉雕像{割れたウポラ像}]）；奥鲁提加（オルテカ）左下一格有金块[*建议保留*]；右上角的盗贼村庄让米拉诺进入掠夺，可以得到青铜盾牌（ブロンズシールド）######
敌人装备:::首领头巾（首领のハチマキ[奥鲁提加装备]）、瞬移靴（ワープシューズ[米泽尔装备]）######

BATTLE FIELD-13 レネシー山脉（雷内西山脉）
胜利条件:::等待出雾/全员山道突破######
失败条件:::我方任一人物战死######
我方配置:::米拉诺，尤古朵拉+2人，罗莎莉拿下MVP +ATK######
可选择卡片数:::13######
body:::注意一开始的时候队伍不能调整，出场4人的话尤古朵拉根本动不了，战术上的安排比较头疼，尽量让第1场战斗最轻松，后几战靠魔法或者积极进攻+运气和RP或许能不损士气。记得让罗莎莉用地狱业火打下烤狮鹫肉，罗斯威尔就只能旁观了。
解决掉山贼残党后等几回合，浓雾就会发生，胜利条件变更为全军山道突破。这时候分别去地图东南角和东北角可以得到打不开的皮包（开かずのカバン）和金刚原石（オーガニウム
来到地图最北的地方发生剧情，这时就能看到脱离点了。路上没有战斗，没有道具，一直冲到头就行了。######
隐藏道具:::打不开的皮包（开かずのカバン）和金刚原石（オーガニウム[*建议保留*]######

BATTLE FIELD-14 ルナミナ峠（鲁那米那峰）
胜利条件:::鲁那米那要塞（ルナミナ要塞）制压/传令部队击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+2人，杜兰拿下MVP +LUK######
可选择卡片数:::6######
body:::本章地图很小，没隐藏道具，敌人以刺客和剑士为主，杜兰和米拉诺在本章会比较活跃。只要小心一下刺客连携时会把投石器也弄进去，很烦人。
另外就是本章的敌人卡片[神盾屏障]效果为短时间无敌，原本势均力敌的战斗很有可能会因此倒向敌人，要做好准备，尽量多用积极战斗或者也用神盾屏障破除他们的特效。
击破BOSS占领要塞后出现敌人的传令兵，同时胜利条件变更为传令兵击破。传令兵只是一个女武神和一个魔女而已，击败女武神后魔女也会败退。记得在占领要塞前部队都向左边靠拢，基本上一回合就能解决掉她们。######

BATTLE FIELD-15 フラム谷仓地帯（夫拉姆谷仓地带）
胜利条件:::伊恩萨基（インサーギ）击破/全员到达罗德尼（ロドニー）街道######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+2人，妮澈拿下MVP +ATK######
可选择卡片数:::9######
body:::本章开始，在队长连携范围内的队员可以进行二次连携，不过每次参战的人数限制在5人内。访问左上角集落可以获得草帽（麦わら帽子）；队伍附近的集落可以得到香气花束（ネスレの花束）。香气花束放久了会成为枯萎的花束（しおれた花束），放得再久会变成枯死的花束（枯れた花束[*建议保留*]）。
第2回合时魔女部队退回城内进行放守，所以要对付的敌人只有佣兵队而已。

本章敌人拥有的卡片为降低攻击力为1的变态卡[妖精之泣]，前期的斧战士和骑兵队靠米拉诺，后期伊恩萨基接近时要把米拉诺扔一边去。新学的二次连携虽然实用，不过反击时被卷入的单位也更多，记得在我方回合结束后把士气不高的队员移开。
击破伊恩萨基后胜利条件变更为全员罗德尼（ロドニー）街道移动。
第2回合时左上方出现女武神艾基娜的追兵（此处如果不想和她遭遇的话可以备上移动力高的卡片一口气闪人……）艾基娜（アイギナ）能力极强，装备武器带有特效50%必杀几率，士气也高达5000多，每回合还会恢复。击破后在她出现的道路尽头，与城门架桥同一列的最上方有隐藏道具金色の麦穂。######
敌人装备:::百战头巾（歴戦のバンダナ[伊恩萨基装备]），告死之剑（デスブリンガー[艾基娜装备]）######

BATTLE FIELD-16 北パルティナ（北巴鲁提亚）
胜利条件:::绯雪姬艾米莉奥（エミリオ）击破/全部敌人击破/击败尤蒂（ユーディ），夺取炮台/黑骑士里昂击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+2人，罗莎莉拿下MVP +ATK######
可选择卡片数:::9######
body:::一开始就受到了绯天骑士的突击，这场战斗不能带杜兰出来，否则会死得很难看。敌人会使用暗黑属性的攻击，对我方很不利。冰属性攻击对她们能造成比较大的伤害。应该带出冰属性的那张寒冰风暴。另外敌人会使用带有异常状态的攻击，那张恢复异常状态的卡[净化之光]最好也带出来。罗莎莉用地狱业火打烤狮鹫肉。
中间的锻冶屋内可以将先前得到的金刚原石（オーガニウム）打造成食人魔之刃（オーガブレード），左边的锻冶屋可以将先前得到的金块锻冶成黄金矛（ゴールデンスピア）。
击破绯雪姬后胜利条件变更为敌全灭，同时地图上开始出现“炮台”，移动时可以看到红色的边框，这就是炮击范围的表示。移动时尽量避开炮击范围，一口气突破。
中部通道上第1个魔法师所在的位置有隐藏道具:微温的哑弹（少し温かい不発弾）；第3个魔法师所在的位置有甜草莓（スウィートベリー）。
这个时候与左边的骑兵发生战斗会必败。被炮轰6次后（必须被炮轰T_T，留3个队员士气不够的队员在炮击范围内，其他队员看着就好……)，发生剧情，我方增援，第2关出现的基莉艾出现在大炮附近。胜利条件变更为夺取大炮。击破魔女尤蒂（ユーデイ）才能夺取大炮，但是增援的基莉艾未必能轻易战胜她，所以要派人到她的连携范围内，再进行一次延伸连携，这样才能快速击破尤蒂，当然也得算好自己的士气，她是很强的。
夺取大炮后胜利条件再次变更为黑骑士里昂击破。
中间王城内让基莉艾去（只有她能去）能得到公主礼服（ブリンセスドレス），炮台左下有道具-破裂的哑弹（キス入り不発弾）。将上一章得到的香气花束（ネスレの花束）交给城左上集落的娜娜（ナナ），得到娜娜的糖果（ナナのキャンディ）不过这样会损失的后面可得的另一有用道具
黑骑士在街道战中非常强大，加上他的攻击力很强，一般角色很难胜利，而且骑兵喜欢用将对方单位减少至与自己相同数量的卡效果[钢铁战车]，对我方的非骑士队员非常不利。让最多士气的人在左边堵路，用大炮猛轰敌军，最后别忘抽空去拿宝物，基莉艾对骑兵能造成巨大伤害，让她多参与连携（她出不来）######
隐藏道具:::城最西边可以得到宝の地図（卡罗那近郊特殊道具反应）######


通关入手卡片:::混沌重力（グラヴイティカオス）######
敌人装备:::泰迪熊宝宝（クマのぬいぐるみ[艾米莉奥装备]），淑女大衣（淑女のコート[尤蒂装备]），黑暗灾难（暗のカタストロフ[里昂装备]）。######

BATTLE FIELD-17 南パルティナ（南巴鲁提亚）
胜利条件:::军神巴鲁多斯（バルドゥス）击破/击败希尔维亚，死守炮台/焰帝加鲁卡萨（ガルカーサ）击破######
失败条件:::米拉诺，尤古朵拉战死，基莉艾战死######
我方配置:::米拉诺，尤古朵拉、基莉艾+2人，米拉诺拿下MVP +TEC######
可选择卡片数:::8######
body:::本章出现2大敌方强人：军神巴鲁多斯和焰帝加鲁卡萨。
战前只要稍微整顿一下，装备一些新的武器，对付这些敌人并不难，军神巴鲁多斯（バルドゥス）交给米拉诺，狮鹫骑士交给尤古朵拉和魔法师罗莎莉/罗斯威尔，而基莉艾看守大炮没有人碰得到她。
基莉艾移动到最左边可以得到隐藏道具猫眼（キャッツアイ）。
击破军神后大炮附近出现敌人暗杀部队希尔维亚和艾蕾娜，同时胜利条件变更，死守炮台。敌人的暗杀者虽然有2人且都是有名有姓，但是基莉艾更强，她一个人足够应付。
大炮守住之后战斗进入第3阶段，胜利条件变为焰帝加鲁卡萨（ガルカーサ）击破！
焰帝的实力自然没话说，但是要注意的不光是他一个人，女武神艾基娜的装备附加属性单挑必胜（一骑讨必胜）。最好用克制她的职业（如骑士和魔法师）将她搞定，或者直接偷来，否则运气不好的话也很难赢她。######
隐藏道具:::焰帝所在地，城门左下一格有勇者胸章（勇者バッジ[*建议保留*]）。城市中间的集落给予小女孩娜娜的糖果（ナナのキャンディ），她会告诉你城门的某边有隐藏宝物（就是勇者胸章）。######

敌人装备:::彩虹弓（虹色アーク[艾蕾娜装备]），梦魇（ナイトメア[希尔维亚装备]），送葬剑佐鲁菲（葬送剣ソルフィ[艾基娜装备]），豪枪一本鬼（巴鲁多斯装备），终极速击（アーリードライブ[加鲁卡萨装备]）######

BATTLE FIELD-18 マキナ•ブリッジ（玛基那大桥）
胜利条件:::己方救援到达，加鲁卡萨击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺+2人，米拉诺拿下MVP +LUK######
可选择卡片数:::9######
body:::米拉诺装备百战头巾，魔法师装备红宝石之杖。
真•超级无敌剧情章，先是公主去追加鲁卡萨，结果中了艾基娜伏兵被捉。此时胜利条件变更为全员撤退，尤古朵拉被带走后下方来了一群兵堵路，打也打不死，等几个回合后敌人自动被中间那个大法师内希亚（ネシア）搞定，结果大法师说了几句话自己也死了。然后脱离点出来了，过去吧。######
隐藏道具:::脱离点右上角一格有真理之小镜（映见の手镜[人物事典开启]）######
敌人装备:::以太结晶（エーテリオン[大法师内希亚装备{要求TEC高于4星}]）######

CHAPTER4：被囚禁的尤古朵拉（囚われるユグドラ）

BATTLE FIELD-19 カローナ郊外（卡罗那郊外）
胜利条件:::伊恩萨基（インサーギ）击破/米拉诺潜入监狱######
失败条件:::米拉诺战死/米拉诺遭遇敌人######
我方配置:::米拉诺+3人，妮澈拿下MVP +ATK######
可选择卡片数:::9######
body:::罗莎莉装备幻惑之笛（まやかしの笛），杜兰装备宝の地図。######
隐藏道具:::右边城堡下2格右1格有焦臭的哑弹（焦げ臭い不発弾）######
米拉诺应付骑兵和战士，魔法师、杜兰和妮澈对付剑士，多注意连携，战斗前一定要恢复好士气很轻松就能胜利。因为一开始就在敌人包围中并且每回合会遭到炮击，所以尽量选择较强卡片进行突击，敌人的卡片是降低攻击为1的烦人卡[妖精之泣]，回合拖得越久对我方越不利。
击破伊恩萨基后剧情取得帝国兵の铠，胜利条件变更，失败条件增加，米拉诺与敌人邻接。
杜兰移动时会看到一个特殊标志（在哑弹右上，女巫尤蒂的正下方）在那里可以取得隐藏宝物中的隐藏宝物魅惑的紧身衣（魅惑のビスチェ）。
等到夜晚的时候就会开门，米拉诺移动到左边的门上发生剧情，之后让杜兰进入杀敌，把拦路的女武神解决掉就行了，米拉诺潜入到旗帜处本章结束。

敌人装备:::钢铁头盔（アイアンヘルム[伊恩萨基装备]），贵族眼镜（ノーブルグラス[尤蒂装备]）######
我方默认装备:::帝国军铠甲（米拉诺装备）######

BATTLE FIELD-20 牢塔内部
胜利条件:::寻找被囚禁的尤古朵拉（囚われのユグドラ発见）######
失败条件:::米拉诺战死######
我方配置:::米拉诺+1人，魔法师or妮澈拿下MVP +ATK######
可选择卡片数:::10######
body:::本章任务是探索找人，所以要备上移动最高的卡片。可以根据背景来判断地形。开始时米拉诺上方二格都可以发现道路（需要待机到下回合才能出现）

向左的话会遇到关押的女性和女武神艾基娜，向右则是正确道路，注意，正确道路的出现必须要在指定位置待机才行。可以两边同时待机。
右上角有道具给家人的信（家族への手纸）；左边第2回合待机处左上一格（艾基娜右3格）有道具蒙眼布（目隐しの布）；右边第2回合待机处下一格右二格有隐藏道具生锈的锁（钴びた锁）。
在最左边发现女武神艾基娜，将其击败，不过注意要尽量减少回合，要是回合拖得太长，可能会没有足够的卡片回到右边。
救出的女性芙罗内居然是以前多次交手的魔剑士拉塞尔的未婚妻。明显，拉塞尔就是可以加入的了。
在救出芙罗内的位置上还有隐藏道具铁脚铐（铁の足枷）。######
敌人装备:::白金发饰（プラチナの发饰り[艾基娜装备]）######

BATTLE FIELD-21 アムトーラム広场（阿姆特拉姆广场）
胜利条件:::卡罗那（カローナ）城门突破######
失败条件:::米拉诺战死######
我方配置:::米拉诺+3人，魔法师拿下MVP +GEN######
可选择卡片数:::11######
隐藏道具:::开始的小路下方有武器库钥匙（武器库のカギ）。######
body:::敌人站在一起，连携复杂，我方4人里只有魔法师和米拉诺3人有战斗力，而打开缺口后应当以杜兰为主攻击敌人。
成功消灭拉塞尔下方的士兵并且与之靠近自动发生剧情（前提是前一章救出他的未婚妻），然后他会杀了伊恩萨基（战死），并正式加入队伍。TNV低或者拉塞尔士气很低时，芙罗内会赠给拉塞尔护佑项链生命的祈愿（命のミサンガ[拉塞尔专用]）。不过几率不大，不用太在意。######
敌人装备:::必杀魔具（クリティカライザ[伊恩萨基装备]），妖刀夜叉（拉塞尔装备。他虽然会加入，可以不偷窃他的这个武器，但是默认是装备着的，如果有收集癖最好先偷了下来）######
*我方默认装备:::妖刀夜叉*######

BATTLE FIELD-22 カローナ城（卡罗那城）
胜利条件:::中枢都市罗萨米尔解放/焰帝加鲁卡萨击破######
失败条件:::米拉诺战死######
我方配置:::米拉诺+4人，米拉诺拿下MVP +LUK######
可选择卡片数:::12######
body:::右上角的贫民窟进入会被一对兄妹随机偷取一件物品，再次进入还会被偷（还会被骂……），所以建议不要进去了，他们盗取好道具的几率非常高，很容易丢了什么珍贵道具。

要塞右上的集落可以用勇者胸章（勇者バッジ）换捕虫笼（虫カゴ[*建议保留*]）。地图左上角武器库1号，使用上章得到的武器库钥匙（武器库のカギ）得到上品名枪（エレガントスピア）。
艾基娜附近的敌人会主动出击，都是用弓的要注意不要让他们攻击魔法师。我方回合一口气将他们击破吧。艾基娜装备有反击完全防御的装备，所以她主动攻击的回合比较难击败，尽量让她主动攻击的回合范围内有最少的我军。
解放中枢都市后胜利条件变为焰帝加鲁卡萨（ガルカーサ）击破。
首先要先避开大炮的射击范围，先把尤蒂的魔导部队灭了这样才能安心去对付焰帝，不过要记得控制回合数量，不要拖太久。在炮台附近最左上角有隐藏道具变形的哑弹（変形した不発弾）。
左上炮台入口处最右边，武器库2号有幻景外套（ミラージュコート）。加鲁卡萨右边一格王妃的房间（王妃の部屋）有晚礼服（イブニングドレス）
击破加鲁卡萨后发现原来他是影武者，并不是焰帝，而公主也被马车带走了。
胜利后从20话救出的芙罗内那里得到卡片绿树鞭挞（アイヴィウィッブ）。######
敌人装备:::铁护腕（ガントレット[艾基娜装备]），魔术眼镜（ソーサリーグラス[尤蒂装备]），深红披风（深红のマント[伪加鲁卡萨装备]）######


BATTLE FIELD-23 マルドゥーク南西部（玛鲁多克西南部）
胜利条件:::旗帜处到达/全灭敌人（与敌人遭遇后）or秘密到达森林中的旗帜标志（不与敌人遭遇）######
失败条件:::米拉诺战死######
我方配置:::米拉诺+4人，妮澈拿下MVP +TEC######
可选择卡片数:::10######
body:::穿越森林章，甜草莓（スウィートベリー）装备给杜兰，再派出妮澈，让她往上走到顶，遇到白天睡觉的魔女帕梅拉（パメラ），击破她的话可以得到她的帽子装备，但是千万注意一定要在她睡觉的时候攻击她，否则，卡片威力6000不是闹着玩的。
击破后获得新卡片幸运之神（フォーチュン）。
注意行进途中会遇到帝国士兵，如果与之发生战斗的话将无法进入右边的23.5章。
来到地图最右边（第2个旗帜出现的时候，不要进入第2个旗帜否则就直接进入24章了，会少一个同伴）发现新的通路，右边新出现的旗帜可以进入隐藏关23.5。随后在不发生战斗情况下进入23.5关。
访问民家需要王国军名声16以上，第1个集落用捕兽夹（トラップ）换精灵之弓（エルフィンボウ），右上方集落左2格下1格，在傍晚可以得到剧毒蝮蛇（どくまむし）。
右上方集落用精灵之弓（エルフィンボウ）换野兽利牙（ビーストファング），如果要进入23.5关的话就不要进这个集落了，野兽利牙为米拉诺专用且被弓系克制，还是把精灵之弓留下来给新的猎人同伴比较好。
关于魔女帕梅拉（パメラ） ：她一共有3件装备，23关人鱼不与她接触的话，24关她将装备帕梅拉的扫帚（パメラのほうき），如果与之接触过，或者战斗过，她将带恶魔之尾（悪魔のしっぽ）出场。
若想收复帕梅拉，开启道具图鉴后再次进入23关时，派出妮澈，同样在上面顶部接触魔女，此时会进行长时间的大量对话。可以等待她离开，也可以再次击破。然后不开战情况下进入23.5。23.5正常游戏。
收服要求：道具图鉴里面有魔女的装备。######
通关入手卡片:::幸运之神（フォーチュン）。如果之前拉塞尔没有加入，那么在这里和敌人交手可以得到绿树鞭挞（アイヴィウィッブ）。######
敌人装备:::做梦的帽子（梦见の帽子[帕梅拉装备]）######


BATTLE FIELD-23.5 レジスタ军基地（反抗军基地）
胜利条件:::援护反抗军首领克鲁斯（レジスタンスのクルス援护）我方与克鲁斯[クルス]邻接######
失败条件:::米拉诺战死######
我方配置:::米拉诺+1人######
可选择卡片数:::6######
body:::敌人只有3人，为首的还是前几章出现过的赏金猎人。派出级别最低的队员吧，这一关简直就是拿来赚经验值的。只是克鲁斯（クルス）比较危险，要快速去救援。
路上2个杂兵解决后与克鲁斯邻接，胜利条件变更为移动克里斯到城门处。解决掉占领着城门的米泽尔之后，下方出现敌人增援部队，胜利条件又变更为到达左边的旗帜处。敌人的队长不可击破。旗帜右上角一格有力量蘑菇（チカラダケ）######
隐藏道具:::集落右上一格有杀人蜂的巢（キラービーの巢）######
敌人装备:::马蹄靴子（ヒヅメシュース[米泽尔装备]）######
我方默认装备:::自制的弓（手作りの弓[克鲁斯装备]）######

BATTLE FIELD-24 マルドゥーク北东部（玛鲁多克东北部）
胜利条件:::旗帜处到达/全灭敌人（与敌人遭遇后）or秘密到达森林中的旗帜标志（不与敌人遭遇）######
失败条件:::米拉诺战死######
我方配置:::米拉诺+4人，妮澈拿下MVP +TEC######
可选择卡片数:::10######
body:::有花束道具的话（无论枯荣），记得给某个上场角色装备上捕虫笼（虫カゴ）。杜兰装备力量蘑菇。
要收复小魔女帕梅拉的话，在开启道具图鉴的情况下派出妮澈到地图扩展后的左下角，与帕梅拉进行大量对话。在本关结束后，会触发魔女跟随王国军的剧情。如果收服成功，25关开始可以选择魔女。并给予我方新的卡片，沉眠之夜，即神界兵所用卡片。
要抓珍贵的纯白蝴蝶（真っ白な珍しい蝶）的话，TNV最好在15以上，装备上捕虫笼（虫カゴ）移动一格,注意要有香气花束（ネスレの花束）这个道具，否则白蝴蝶是不会出现的。抓到白蝴蝶后变为笼中的白蝴蝶（カゴの中の白い蝶）。罗斯威尔装备探测杖（ダウジングロッド），在中间集落右1格下1格发现隐藏道具元素结晶（エレメント）。
左下集落左3格上1格有地瓜（ブロティモ）。地瓜太久不吃会变成发芽的地瓜（発芽プロテイモ）。
23和24两关的敌人都不会主动移动，但是如果有我方单位与之邻接的话，强制结束我方回合，敌人回合会围过来施以猛烈的攻击。一旦站位不好就有可能被灭。但是建议在24章把他们全灭一次，赚经验值，顺便得到艾基娜的装备（B28虽然她还会带出来，但是在那一关她和焰帝都无法击破，取得道具有冲突）
如果进入过23.5本章就会少带一个人出场，但是如果不带人鱼，将无法遇到小魔女帕梅拉（地图左下角处）。
艾基娜因为她装备的影响每回合会下降士气。击破艾基娜后得到染血的细剑（血濡れのレイピア）######
隐藏道具:::中间集落右1格上2格世界树的枯枝（世界树の枯れ枝），左上角1格有世界树の叶。######

BATTLE FIELD-25 叹きの谷（叹息谷）
胜利条件:::敌守备队长击破/翻越叹きの谷/突破敌人的包围网/援护艾蕾娜（エレナ）/全员前往死の大地######
失败条件:::米拉诺战死######
我方配置:::米拉诺，基莉艾+2人，杜兰拿下MVP +LUK######
可选择卡片数:::7######
body:::初期敌人数量少，很容易解决。之后胜利条件变更为穿越叹息谷（叹きの谷）。
到达地图右上的时候会出现黑骑士里昂的伏兵。注意他们会先发制人，之前要把队伍整顿好。希尔维亚出现后必须在第一回合把她和艾蕾娜的装备给偷了。
几回合的僵持后，里昂遭到敌人部队艾蕾娜的狙击，撤退，同时胜利条件变更为艾蕾娜援护。1回合后基莉艾赶到，帮助艾蕾娜，这时只要打倒艾蕾娜旁边的士兵与之邻接，她就会撤退，这之前希尔维亚是无法击破的。胜利条件再次变更为全军旗帜处到达。######
隐藏道具:::在右上旗帜下1格左3格有道具骑士杀手（ナイトキラー[里昂隐藏装备]）再下1格左1格有道具骷髅石（ドクロ石）。######

敌人装备:::骑士杀手（ナイトキラー[里昂装备]），天蝎之尾（スコーピオテイル[希尔维亚装备]），飘逸发带（ひらひらリボン[艾米莉奥装备]），流星弓（ミーティア[艾蕾娜装备]）######

BATTLE FIELD-26 死の大地（死之大地）
胜利条件:::打听到尤古朵拉被囚地点（囚われのユグドラ発见）/全员旗帜处到达######
失败条件:::米拉诺战死######
我方配置:::米拉诺，基莉艾+2人，魔法师拿下MVP +GEN######
可选择卡片数:::20######
body:::本章敌人数量非常多，不过上方的敌人部队领队是个刺客，很有可能一击灭之，这样整个部队就全灭了。这边的敌人会使用令士兵叛变的卡[心之逆转]，如果GEN不够高的话就要注意了，尤其是拉塞尔。
左边的敌人胡乱行动后都分散开来，注意克制就能轻松解决。荒地地形对米拉诺有利，本章以他为中心。
上方道路尽头待机出现新集落，开阔地图后的村庄右2格下2格隐藏道具灵魂坩埚（魂のるつぼ）；右方集落让米拉诺访问可以得到食龙刀（ドラゴンイーター[TNV20以上]）左上让能夜晚瞬移的人（装备瞬移靴[ワープシューズ]的罗莎莉，或者罗斯威尔）进入可以得到杀龙卡[龙之终结]。
左边集落向右3格处待机上方出现新集落；右边集落向左4格向上1格处待机出现新集落。进入上方的城市得到确切消息。之后胜利条件变更为到达东边的旗帜处。######
隐藏道具:::灵魂坩埚（魂のるつぼ）######

BATTLE FIELD-27 赎罪の门（赎罪之门）
胜利条件:::艾蕾娜邻接/巴鲁达克要塞攻占/黑骑士里昂击破######
失败条件:::米拉诺战死，艾蕾娜，基莉艾战死######
我方配置:::米拉诺，基莉艾+2人，杜兰拿下MVP +LUK######
可选择卡片数:::7######
body:::杜兰装备猫眼。
与艾蕾娜邻接后任务成功，胜利条件变更为巴鲁特要塞-巴鲁达克城（バルダック）占领。绯雪姬部队带有暗黑攻击卡片，烦人的是带有诅咒异常状态，推荐用神盾屏障（圣盾防御卡），看对方快蓄满必杀的时候放，这样敌人发动必杀就会被盾抵消，盾强制中断后，必杀槽蓄满立刻又可以再放。基本上1回合就能灭了敌人。以防万一，把净化之光（回复异常状态）也带出来吧。诅咒在击破绯雪姬后会自动破除。

另外绯雪姬艾米莉奥（エミリオ）虽然害怕弓矢，但是她的装备带有对弓强的特性。
后半部分在夜晚时，上下方各有一夜集落，上方可以得到暗黑卡片死亡之吻（キスオブデス），下方根据TNV决定交换的道具，TNV较低（15以下）时得到的是妖异的果实（妖しの果実），TNV较高（15以上）时得到的是黑暗金属（ダークマター[*建议保留*]），要求的道具是随机的。如果不是为了收集道具，那么建议拿果子。
第1部分最左下角（上方炮台的下2格处）有隐藏道具玛那之石（マナストーン[*建议保留*]），基莉艾才能发现（其实是她的坐骑阿鲁发现的）。制压巴鲁达克城（バルダック城）后胜利条件变为黑骑士里昂击破。
本章有基莉艾和荒地战有利的米拉诺，对付黑骑士是比较轻松的。击破黑骑士里昂后，里昂战死。######
敌人装备:::小型胸甲（小さな胸当て[艾米莉奥装备]），悲枪西尔维亚（悲枪シルヴィア[里昂装备]）######

BATTLE FIELD-28 ガレオン监狱（卡雷奥恩监狱）
胜利条件:::救出被囚禁的尤古朵拉/全员旗帜处到达/突破敌人的包围/艾蕾娜旗帜处到达/全员脱离战线######
失败条件:::米拉诺战死######
我方配置:::米拉诺+3人，米拉诺拿下MVP并刷级######
可选择卡片数:::8######
body:::地图右边路尽头有道具旧八音盒（古びたオルゴール[BGM宝典开启]）。本章敌人都是杂兵，实力很弱，米拉诺勇猛依旧，只要别陷入连战（一对N）基本不会失败，要注意一下敌人持有的卡片是圣盾防御。所以要尽快击破敌人。
救出公主后胜利条件变更为逃跑，移动至旗帜处即可。
尤古朵拉被绑的地方有绳子（ロープ）[*建议保留*]。救公主时切记先把大部队移动开，敌人的皇骑士和焰帝第1回合能攻击到救公主的角色，推荐用米拉诺，荒野地形有利的他用杀龙卡或者神盾屏障与皇骑士的战斗也能轻松取胜。另外，让罗莎莉去打烤龙排。
部队移动到中段时左方出现敌人增援艾基娜以及她的部下，这时候她们的部队是无法击破的，并且不会移动，不要去招她，专心对付加鲁卡萨和他的骑兵。1回合后艾蕾娜出现，将她移动到高台处发生剧情（阻击女武神艾基娜）左边女武神撤退。
回王城后与占卜师巴鲁提亚之母（パルティナの母）对话得到卡片沙暴粉碎（サンドストーム）。*]
道路通畅后继续跑路。
大部队撤退的旗帜右2格往下2格有道具：锈蚀的剑（朽ち果てた剣）[*建议保留*]。皇骑士追过来会分散队型，逐个击破能得到大量经验值升级，最后让米拉诺把焰帝的武器偷了，再闪。焰帝无法击破。######
隐藏道具:::艾蕾娜去高台的路上第2格有失落的原料（ロストマテリアル）[*建议保留*]######
敌人装备:::恶魔之翼（インフェルノ[加鲁卡萨装备]）；如果24关与艾基娜发生战斗并得到了她的武器，这里她会没有装备，否则就是沾血的细剑（血濡れのレイピア）######


CHAPTER5：光与影中动荡的罪恶与真实（光と影にたゆたう罪と真実）

BATTLE FIELD-29 ニルルド砂漠北部（尼鲁鲁多沙漠北部）
胜利条件:::解放拉伊内镇（ライネの町解放）/前往索内特（ソネッタ）镇/蛮贼王多鲁特（ドルト）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+2人，艾蕾娜拿下MVP +LUK######
可选择卡片数:::10######
body:::艾蕾娜装备妖异的果实（妖しいの果実），拉塞尔装备烤龙排（ドラゴンステ—キ），尤古朵拉装备可可利果实（ココリの実）。
变态的沙漠地形，1回合每人只能移动1格。但这一场要减少败仗，保持住一个较高的TNV值。
既然有水地形就要把妮澈带出来。注意尽量让队员站在街道地形上。下方水池上三格左一格遇到濒死的温蒂妮，救活她后得到人鱼之鳍（マーメイドフィン）并打听到水池中隐藏道具的情报。
当部队行进至左下的时候出现敌人伏兵，胜利条件改变为蛮王多鲁特击破。第一回合是蛮王多鲁特先攻，而且与我方大面积邻接，注意站好队形。回合结束后援军基莉艾赶到。注意队员最好不要站在沙漠地形上，这样就可以无视对方的卡片必杀。
击破蛮王后地区左下角出现新都市。左边集落用绳子（ロープ）换幻兽亚羝之角（幻兽ヤーデのツノ）；左边集落上3格左2格白天能找到砂の蔷薇[*建议保留*]；打败蛮王后，在地图最左上右边一格处待机会发现新集落（只有白天才能看到），有香气薄荷（エレミナミント）的情况下尤古朵拉进入后发生沐浴事件，然后得到妖精铃铛（フェアリーベル）。
在左下湖的右边一格有道具：力量果实（パワーフルーツ）######
隐藏道具:::下方水地形中有星屑（スターダスト）[*建议保留*]，不过要晚上才能看到。######
敌人装备:::开膛手利爪（ジャックハンド[希尔维亚装备]），龙靴（ドラゴンブーツ[米泽尔装备]），毁灭大锤（破灭のハンマー[蛮王装备]）######

BATTLE FIELD-30 ニルルド砂漠南部（尼鲁鲁多沙漠南部）
胜利条件:::左下都市兰科特（ランケット）解放/（TNV高于20时）蛮王多鲁特（ドルト）击破######
失败条件:::米拉诺，尤古朵拉战死，基莉艾战死######
我方配置:::米拉诺，尤古朵拉+2人，艾蕾娜拿下MVP +LUK######
可选择卡片数:::12######
body:::艾蕾娜装备力量果实，妮澈装备香气薄荷。
本章一开始绯雪姬就带着她的2个部下向西移动，第2个回合就会离开，她身上携带着提高GEN的珍贵道具核桃面包（くるみバン），因为她在这一关不可击破（protect），所以应该选择偷窃卡，将米拉诺排在第3位置，用基莉艾去攻击（其他人都无法移动2格），事先蓄满必杀槽，一轮到男主角就使用，这样就能得到她装备的道具了（当然这里不得到的话下一章还有机会）。
第2部分要求TNV名声高于20，否则会直接结束30关。最好把敌人全灭一遍，不要直接击破其队长。左下都市解放后胜利条件变更为蛮王击破，敌人出现在地图右下。中间的集落需要星屑（スターダスト）和砂の蔷薇换星尘沙漏（星屑の砂时计[*建议保留*]）。第二部分除了基莉艾，其他人一开始是无法参战的。蛮王左边有隐藏道具太阳宝玉（太阳のオーブ）
注意没击破守护神之前，敌人处于HIGH状态并且每回合恢复士气。######
隐藏道具:::地图左上角向下2格，有由米娜的日记（ユミナの日记）[*建议保留*]；地图右上角向下4格向左1格，有巨兽骆肯之骨（巨獣ロコンの骨）；地图最下方的水池右一格有橘子（メブルの果実）######
敌人装备:::核桃面包（くるみパン[艾米莉奥装备]），石巨人套装（ゴーレムスーツド[守护神装备]），花哨的头巾（派手なターバン[蛮王装备]）######


BATTLE FIELD-31 宗教都市群ロンバルディア（宗教都市罗恩帕鲁迪亚）
胜利条件:::援护神殿骑士哥顿（ゴードン）与其邻接/前往教会（哥顿到达教会）/玛鲁迪姆（マルディム）击破######
失败条件:::米拉诺，尤古朵拉战死，基莉艾战死，哥顿战死/艾米莉奥发现教皇约海姆（ヨハイム）######
我方配置:::米拉诺，尤古朵拉+2人，妮澈拿下MVP######
可选择卡片数:::14######
body:::要点：身上不能拥有骷髅石（ドクロ石）这个道具，否则任何地方都进不去。这一关后半部分有大量的架桥地形和水边地形，对骑士和温蒂妮有利，应让杜兰和妮澈上场，人员确定。
开始的集落用笼中的白蝴蝶（カゴの中の白い蝶）换幸运魔符（幸运のタリスマン）。神殿骑士哥顿实力强劲，不会有危险，并且每回合有基莉艾的炮击支援。后方没有隐藏道具，直接杀过去找BOSS就可以了。
击破后胜利条件变更为主教搜索，将骑士移动到左上的旧教会教堂。注意不要让我方队员站在沙漠地形上，让哥顿和基莉艾去就好。这时绯雪姬再次出现，并每回合出现一个部下的增援。击破绯雪姬前不要让基莉艾站在教堂上，而且要尽快将绯雪姬击破。
占领教堂后胜利条件变更为左下的大司教玛鲁迪姆及尤贝伦（ユベロン）击破，敌人的骷髅在白天会睡觉，趁白天的时候击破他们吧。
BOSS城右边的集落是少女由米娜（ユミナ）的家，将日记还给她可以得到报酬童话伪翼（メルヘン伪翼）。######
隐藏道具:::基本上全部的集落都要求一定的名声才能进入，要尽量减少败仗，把TNV保持在20以上。地图第三次扩大后，上方集落能得到七星宝剑；中间的祈祷所用剧毒蝮蛇（どくまむし）和巨兽骆肯之骨（巨獣ロコンの骨）制作南康的秘药（ラカンの秘薬）；BOSS附近的集落、夜晚才能进入的魔女馆用锈蚀的剑（朽ち果てた剣）和玛那之石（マナストーン）合成魔法剑（マジカルソード）；魔女馆右2格水中有闪闪发亮的金币（きらきら金货）[*建议保留*]；左上集落根据TNV得到不同的道具，女性限定在傍晚得到黄昏面纱（黄昏のヴェール），要求TNV高于15。TNV低时，黑暗金属（ダークマター）换黑暗之剑（ダークセイバー）。######

敌人装备:::开膛手利爪（ジャックハンド[希尔维亚装备]），宝石之杖（ジュエルロッド[玛鲁提姆装备]）######

BATTLE FIELD-32 圣メリアータ教会领（圣梅利亚塔教会领）
胜利条件:::尤贝伦司教（ユベロン卿）击破/死守圣地/尤古朵拉到达圣地前死守教会/焰帝击破######
失败条件:::米拉诺，尤古朵拉战死，基莉艾战死，哥顿战死/敌人进入圣梅利亚塔教会######
我方配置:::米拉诺，尤古朵拉，基莉艾+2人，艾蕾娜拿下MVP +LUK######
可选择卡片数:::14######
body:::艾蕾娜装备开膛手利爪，魔法师装备南康的秘药（ラカンの秘薬）。
中间被水包围的小岛有隐藏道具香蕉（バナナンの実）；中间架桥左3格处的果树园内也有隐藏道具卡林卡红莓（カリンカの赤い実）。下方的炼金术士屋可以将星尘漏斗（星屑の砂石计）和失落原料（ロストマテリアル）炼成道具珍圈玛瑟拉瓦帝（珍圈マセラマティ[全能力DOWN]）/神圈玛瑟拉瓦帝（神圈マセラマティ[全能力UP]），要求TNV24以上，炼金术进程随着游戏的进行变化，但最后成不成功很难说。
注意骸骨士兵会放毒，尤贝伦的部队会使用石化攻击，GEN低的就不要上了，像米拉诺这样不会中石化的当然是主力。记得在打骸骨士兵的时候要在结束回合前把空位补上，否则敌方的骑兵会跨越骸骨士兵发起攻击。
左边击破后胜利条件变更为教会死守。最后一回合时最好选择神盾屏障，否则陷入连战的哥顿很可能被KO。一开始不要去招惹他们，让哥顿（ゴードン）去顶住敌人的皇骑士，因为道路狭窄他们无法连携。如果把女武神引过来就不好办了。等尤古朵拉到达目的地之后胜利条件变更为焰帝击破，这时候再进行反击。######
通关入手卡片:::蛇妖之眼（メデューサアイ）######
敌人装备:::炼金的单镜片（錬金のモノクル[玛鲁迪姆装备]），撕裂风的苍之爪（风ヲ切裂ク苍ノ爪[敌方女法师阿玛蕾乌丝装备]），圣书（尤贝伦装备），禁忌的玫瑰链（禁忌のロザリオ[艾基娜装备]），炽日（バーニングサン[加鲁卡萨装备]）######
我方默认装备:::奇迹之冠（奇迹のティアラ[教皇约海姆装备]）######

CHAPTER6：格兰•桑秋里奥（グラン•センチュリオ）

BATTLE FIELD-33 圣地ベルヘイム（圣地贝鲁海姆）
胜利条件:::罗斯威尔or罗莎莉击破######
失败条件:::尤古朵拉战死######
我方配置:::尤古朵拉1人，拿下MVP +TEC######
可选择卡片数:::12######
body:::尤古朵拉的独斗，本章的敌人是黑蔷薇罗斯威尔/白蔷薇罗莎莉+2个骷髅/石头人。
尤古朵拉开始就处于HIGH状态，士气每回合恢复。所以没什么好担心的一口气冲过去。
——本战想败都很难。######
隐藏道具:::开始处向左2格下1格-奥利哈钢（オリハルコン）[*建议保留*]、地图最右边有禁果（禁断の果実）。######
敌人装备:::白蔷薇的家徽（白蔷薇のクレスト）OR黑蔷薇的家徽（黒蔷薇のクレスト）。注意没有偷窃，尤古朵拉的LUK不高就没办法了（她装备着绢丝大衣，6map内不能再装备其他道具）。######


BATTLE FIELD-34 ナハトの祭坛（那哈特祭坛）
胜利条件:::击破女武神艾基娜######
失败条件:::尤古朵拉战死######
我方配置:::尤古朵拉1人，拿下MVP +GEN######
可选择卡片数:::1######
body:::开始时获得卡片最终圣战（ジハード）。
剧情与女武神艾基娜战斗。攻击时蓄满力一个必杀，KO。尤古朵拉剧情转职成为圣女女王，转职后追加能力ACE限定无视（卡片必杀发动要求的领队武器无视）异常状态无效化，并且没有惧怕暗黑属性攻击的不良能力。######
敌人装备:::复仇者（リヴェンジャー[艾基娜装备]）######



CHPTER7：龙长眠的大地尽头（竜の眠る最果ての地へ）

BATTLE FIELD-35 カノサー町（卡诺萨街道）
胜利条件:::正门突破（军神巴鲁多斯击破）/全员向丘陵地带撤退（全员旗帜处到达）######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺、尤古朵拉+4人，艾蕾娜拿下MVP +LUK######
可选择卡片数:::16######
body:::尤古朵拉装备魔法剑（マジカルソード），杜兰装备橘子（メブルの果実），拉塞尔装备禁果（禁断の果実），艾蕾娜装备核桃面包（くるみバン）。
本章的胜利条件是骗人的，与敌人发生2次战斗后就会进入第2阶段。敌人的骑兵队连携过分且不败（尤古朵拉的无敌卡还是可以打动的，一个人单挑一个队都行，不过敌人士气最低为1，不可击破）######
隐藏道具:::用杜兰穿越敌人来到最右上角可以得到沾满泥的哑弹（泥つきの不発弾）。地图扩展后右下的集落（那里有个流浪的锻造师，所以不一定能碰到，不过每回合都进去看看总能碰到的）用持剑的角色进入可以奥利哈钢（オリハルコン）打造王者之剑（圣剣エクスカリバー），让罗斯威尔进入可以用元素结晶（エレメント）和世界树的枯枝（世界树の枯れ枝）制作元素之杖（エレメントロッド）。罗莎莉就只好旁观了。######
敌人装备:::战神的大盾（マルスの大盾[巴鲁多斯装备]），飞天扫帚（フォーミュラー[尤蒂装备]）######

BATTLE FIELD-36 砦の南门前（要塞南门前）～迂回山道
胜利条件:::米拉诺和艾蕾娜到达下方旗帜，其他人南门前待命/旗帜处到达######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺、艾蕾娜别动队，尤古朵拉+3人，尤古朵拉/拉塞尔拿下MVP######
可选择卡片数:::10######
body:::拉塞尔装备真.斩铁剑，杜兰装备香蕉（バナナンの実），艾蕾娜装备卡林卡红莓（カリンカの赤い実）。
本章乃挨打章，敌人依然是无敌的骑兵团，米拉诺和艾蕾娜每3回合移动一次（夜晚才可以移动）。到达地方后战斗结束。反正是不可能赢的，所以将不能回复士气的预先恢复好。4人一直顶着，如果有快不行的，让魔法师（等级最好高点）使用召唤卡，无敌骑士团立刻攻击召唤物去了……这样基本不会有挂的，最后让尤古朵拉用最终圣战。
进去之后就是一直线队形无法变更，最后一个位置在炮台攻击范围外。留给最弱的队员进去吧。

上章如果得到了战神的大盾（マルスの大盾），本章军神就没装备，否则就是战神的大盾。######

BATTLE FIELD-37 迂回山道～水门
胜利条件:::水门到达######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，艾蕾娜，艾蕾娜拿下MVP +LUK######
可选择卡片数:::9######
body:::艾蕾娜装备撕裂风的苍之爪（风ヲ切裂ク苍ノ爪）。
走到第3部分遇到敌人暗杀部队，战斗胜利条件改变为队长希尔维亚击破。注意敌人会特技暗杀队长（血之利爪）且敌人的TEC很高。米拉诺和艾蕾娜的GEN不高于4大星1小星的话就吃吃补品吧。
追了一回儿，基莉艾赶到，这时候击破敌人队长就不成问题了。击破后，希尔维亚战死。
城标志下一格有隐藏道具山葡萄，结束后胜利条件变更为5回合内水门制压。######
敌人装备:::屠杀之爪（カルネージクロー[希尔维亚装备]）######

BATTLE FIELD-38 伊修那特要塞内
胜利条件:::全军邻接/敌全灭######
失败条件:::米拉诺，尤古朵拉战死，基莉艾战死######
我方配置:::米拉诺、艾蕾娜别动队，尤古朵拉，基莉艾+2人，拉塞尔拿下MVP######
可选择卡片数:::17######
隐藏道具:::击破女武神队去右上角有潮湿的哑弹（湿った不发弹），中间的单独地区让罗斯威尔去能找到狙击镜片（スナイブクラス[罗莎莉依然旁观]）。######
body:::妮澈装备玻璃瓶（ガラスのピン）。
夜晚来到左边的水边地形中有隐藏道具泥鳅（ドゼウ），妮澈装备玻璃瓶的情况下，得到后移动一次就能组合成瓶中的泥鳅（ビン中のドゼウ），否则就是干泥鳅（干からびたドゼウ）。得到泥鳅后再回池塘还能再抓到一条泥鳅。泥鳅很快变成死掉的泥鳅（死んだドゼウ），再过一会儿变成干泥鳅（干からびたドゼウ），长期不食用就会变成腐烂的泥鳅（腐ったドゼウ）（……好RP的泥鳅！）。
部队合流后胜利条件变更为敌全灭。
绯雪姬击破后占领城市，军神下令开修罗门，这样就可以与他们战斗了。
炮台右下一格有开孔的哑弹（穴の开いた不発弾）######
敌人装备:::串珠手环（ビーズの腕轮[艾米莉奥装备]），极丽十字铠（グランドクロス[巴鲁多斯装备]）。本章可以击破尤蒂从而得到她的飞天扫帚（フォーミュラー）######

BATTLE FIELD-39 ブロンキアの门（布隆基亚之门）
胜利条件:::军神巴鲁多斯击破######
失败条件:::米拉诺，尤古朵拉战死基莉艾战死######
我方配置:::米拉诺，尤古朵拉+2人，拉塞尔拿下MVP######
可选择卡片数:::12######
body:::妮澈装备瓶中的泥鳅（ビン中のドゼウ）.
清理完BOSS附近的杂兵就祭出尤古朵拉的无敌卡吧，BOSS处于HIGH状态，每回合都会自动恢复满士气，让基莉艾、米拉诺和尤古朵拉上吧，或者杜兰装备上骑士杀手（ナイトキラー），一回合灭之。
终于军神战死，本章结束。战斗后从基莉艾那里获得卡片：泥沼缠绕（マントラッブ）######
隐藏道具:::右上的门右上一格有道具图鉴（アイテム图鉴）[道具宝典开启]######
敌人装备:::名马瓦多纳（名马ワードナ[巴鲁多斯装备]）######


BATTLE FIELD-40 バルットの丘（巴鲁特之丘）
胜利条件:::攻占罗纳利斯要塞/攻占希诺玛要塞######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+4人，拉塞尔拿下MVP######
可选择卡片数:::8######
body:::妮澈装备死泥鳅（死んだドゼウ），艾蕾娜装备山葡萄，米拉诺装备童话伪翼（メルヘン伪翼）。
后半部分有大量水边地形，一定要让妮澈上场，好好利用地形优势。
敌人这次全是民兵，实力很差所以很轻易就能解决，即使敌人持有的是复活士兵的卡片。
打到第二个要塞的时候，一回合后左下角出现敌人增援绯雪姬艾米莉奥，处于HIGH状态。如果一回合内灭了民兵首领卡南，那么艾米莉奥不会出现。
中间水域中最左边一格有隐藏道具订婚戒指（エンゲージリング）。订婚戒指处下方的集落用订婚戒指换丝织头巾（绢织りの头巾）。换取到头巾后再次去找到订婚戒指的地方，可以再次找到订婚戒指。地图最左上角的锻冶物能改造武器。他要某一件武器打造成钝剑（ナマクラソード），每次玩都不同。
第2部分，卡南下1格右1格集落得到蓝苹果（苍のりんご），艾米莉奥出现的位置附近的集落用闪闪发亮的金币（きらきら金货）向乞丐换邪眼。######
敌人装备:::希望的玫瑰链（希望のロザリオ[民兵女首领莫妮卡装备]），勇者之心（ライオンハート[民兵男首领卡南装备]），黑猫耳饰（黒ネコの耳饰り[艾米莉奥装备]）######

BATTLE FIELD-41 ドロミノス湿地帯（多罗米洛斯湿地）
胜利条件:::敌全灭######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+4人，魔法师拿下MVP######
可选择卡片数:::全部######
body:::如果前面冶炼了矿物，那么这一关结束的时候TNV要在24以上。
罗莎莉装备魅惑的紧身衣（魅惑のビスチェ），拉塞尔装备结实的长筒靴（丈夫な长靴）。
出现新的毒沼地形，每回合只能移动1格，并且会受到士气伤害。把童话伪翼和结实的长筒靴装备上吧，还建议装备上恢复士气的装备，或者给领队装上连战不减队员人数的道具。士气不够高的队员就不要下沼泽里了。结实的长筒靴装备给队长。
绯雪姬和义勇军主动出击，我军尽量快速赶到左边的荒野，利用有利地形战斗，以用剑、杖或弓箭的队员为主。击破后，绯雪姬艾米莉奥战死。
架桥左一格上两格的集落里，用瓶中的泥鳅（ビン中のドゼウ）换取蜥蜴干（干からびたトカゲ）。夜晚在地图中部下方的集落用全部的哑弹交换道具。根据哑弹的收集数量决定给予的道具。如果收集齐全部的哑弹，给予的道具是螺旋钻头（ハイパードリル[*建议保留*]），或者是处刑之环（ギロチンカッター）。
左下集落右3格向下突出的泥沼地中有隐藏道具天骸鹫（フレースヴェルク）；地图中下部集落右一格、上两格再右四格的泥沼地中有隐藏道具萨满面具（シャ—マンマスク）。正中上方敌人堵住的集落，派人进去会被村民扔狮鹫蛋，所以得到了道具蛋壳碎片。
装备邪眼后可以在地图最下方（要穿越毒沼泽）找到悪霊の呪符。######
敌人装备:::黑色玛利亚（ブラックマリア[艾米莉奥装备，妮澈专用的LOLITA服装]）######


CHAPTER8：布隆基亚大决战（ブロンキア大决戦）

BATTLE FIELD-42 凯旋门（凯旋门）
胜利条件:::门前敌全灭/攻占凯旋门######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+4人，杜兰拿下MVP######
可选择卡片数:::9######
body:::杜兰装备上品名枪（エレガントスピア），妮澈装备寒冰标枪（アイスジャベリン）。
开始时剧情，被炮轰几回合基莉艾就会出现，并且发动特攻，自爆毁掉魔炮。敌大破，尤蒂战死。这时就可以攻破凯旋门了。敌人只剩几个杂兵，很容易对付了。######
隐藏道具:::右上角独立的一格向下数4格，基莉艾的阿鲁遗留下的狮鹫骑士的羽毛（グリフォンの羽根），爆炸中心左下角，魔炮的碎片（魔炮のカケラ）。爆炸中心让罗斯威尔在夜间进入得到南十字权杖（好像最后回收战利品的时候也可以自动取得）。######
敌人装备:::南十字权杖（サザンクロス[尤蒂装备]），伊夫里特乱舞（イフリートレイン[加鲁卡萨装备]）。凯旋门前所有的龙骑士都有勋章，攻破凯旋门后守卫队长持有一枚。######

BATTLE FIELD-43 帝都フレアブェルク（帝都夫雷亚维鲁克）
胜利条件:::双生战乙女击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+4人，妮澈拿下MVP######
可选择卡片数:::10######
body:::注意双生女武神分2个部队，离一个部队较远的话她们不会行动，否则被夹击可不是闹着玩的。地图最左上角有隐藏道具走失的龙（はぐれドラゴン）。
打倒任何一个女武神另一个都会准备撤退，并且胜利条件变为击破她，她变成HIGH状态，每回合恢复满士气。将杂兵清完后用强力卡一口气将女武神击破吧。不过要想清楚最后用来击败女武神的卡片，因为下一关的一开始，这张卡将自动成为用来对抗加鲁卡萨部队的卡。######
敌人装备:::湛蓝之刺（ブルースティング[露希艾娜装备]），赤色红莲（レッドクリムゾン[艾基娜装备]）######

BATTLE FIELD-44 ブロンキア城（布隆基亚城）
胜利条件:::焰帝击破/战乙女击破/魔龙焰帝击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+4人######
可选择卡片数:::10######
body:::杜兰装备走失的龙（はぐれドラゴン），米拉诺装备食龙者。
一开始就会与焰帝的队伍对上并受到炮击，事先恢复好队员士气。焰帝不在HIGH状态，但是我军如果全体能力不强很容易被连携拖累，尽快打出一个空位让尤古朵拉赶过去顶上。
击破BOSS（撤退）后胜利条件变更为女武神击破。一回合后焰帝再次出击，注意队伍后方不要被他的皇骑兵偷袭了。女武神不会移动，在攻打女武神的时候把队伍都挪到右方，派两名强队员殿后。
击破女武神后胜利条件变更为焰帝击破，但1回合后魔龙觉醒，焰帝变身，我方每回合受到灼热伤害，士气被损。所以要尽快击破他。虽然有HIGH状态，但是士气只有6000多，GEN也非常低。
焰帝加鲁卡萨再次出击时带着武器装备火蜥蜴（サラマンドラ[米拉诺专用武器]）。######
隐藏道具:::加鲁卡萨二次出击时，左边投石器右一格，梅沙拉的石板（メサラの石版[公主战记开启]）######
敌人装备:::伊夫里特乱舞（イフリートレイン[加鲁卡萨装备]）。上一场战斗先击破哪个女武神决定这章的装备；先击破露希艾娜（ルシエナ），那么艾基娜（アギナ）就带着时代终结（エンドオブエイジ）出场；反之是露希艾娜带着银檞之剑（ミストルティン）出场。######


BATTLE FIELD-45 魔竜ブロンガの间（魔龙布隆加之间）
胜利条件:::粉碎焰帝加鲁卡萨的野心######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+1人######
可选择卡片数:::3######
body:::出3张强力卡追杀就是。受到火焰影响每人一回合只能移动一步。魔龙醒觉的焰帝不会反击，一心逃进深渊，建议带上尤古朵拉的无敌卡，以她为主力攻击，否则无法把最左边的同伴连携进来。
本处如果阻止不了焰帝，让他进入深渊，那么就会迎来第1个结局，魔龙复活，地面再次万劫不复。######
敌人装备:::日珥刃（プロミネンス）[这种时候还有装备实在令人费解，不过魔龙醒觉的焰帝抑制B型必杀，是偷不到的。只能看先攻的LUK高不高吧]######


CHAPTER9：战争的安魂曲（バトル•オン•ザ•レクイエム）

BATTLE FIELD-46 失楽の地アンカルジア（失乐之地安卡鲁基亚）
胜利条件:::基莉艾（灵魂）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+######
可选择卡片数:::7######
body:::基莉艾击破即可，得到少女的眼泪（乙女の涙）。######

BATTLE FIELD-47 大神殿
胜利条件:::堕天使内希亚（堕天のネシア）击破######
失败条件:::米拉诺，尤古朵拉战死######
我方配置:::米拉诺，尤古朵拉+######
可选择卡片数:::9######
body:::这一关里可以给队员们装备上2map的道具，如果可能的话，给尤古朵拉装备上她在第一关里弄丢的发圈。
不得不提的是，内希亚所持有的卡片[转生预言]点数为8200，虽然不是攻击性卡片，不过一旦被打败后果惨重。不要让艾蕾娜被女武神阿施塔特攻击，除非用血之利爪先攻，否则她必败。避免魔法师和内希亚交战。
打败内希亚后，获得他的诸神启示录（人物事典开启）。######
隐藏道具:::中间的湖中有温蒂妮一族一直在寻找的转生石（転生石）。在有螺旋钻头（ハイパードリル）的情况下，到地图最右边“感到强大力量的地方”连续3次，掘得诸神黄昏（ファンネリア）。######

BATTLE FIELD-48   へヴンズグート（天国之门）
胜利条件:::（选择）1.封印圣剑，创造没有战争的世界（尤古朵拉回到上方大神殿）2. 圣剑之下即为正义！（大天使玛莉艾达击破 ######
失败条件:::全员战死, 卡片用完######
我方配置:::米拉诺，尤古朵拉+3人######
可选择卡片数:::16######
body:::本章可以选择结局：
听从守护大天使玛莉艾达的话将尤古朵拉移动到上方城，封印圣剑后得到她给予我方的装备-睿智的圣杖（敏智の圣杖），迎来结局2。大地一派欣荣，世界一派和平。未来一片美好，前途一片光明。
与大天使发生战斗，将队员移动过去攻击她即可。头两回合是纯粹的移动，不要在这两回合把卡片浪费了。卡片不要在意ACE限制，哪张强力带哪张。
大天使有AS护盾，突击、必杀等均无效。本章一定要派遣强力角色，事先恢复好士气（最终章了，有道具就毫不吝啬地奖励掉吧）围攻她，虽然看着自己的士气一直在降，其实她的也在降。她不会主动攻击，顺利的话一回合能打掉她2000左右的士气，她的士气为20000左右（显示为“????”，直到四位数值才会显示），缠斗了8、9个回合她士气降低为1时，祭出尤古朵拉的无敌卡[最终圣战]秒杀。
都最后了，打倒玛莉艾达也没有什么意义，所以这个选择不是什么很光明的结局。另外，这个结局非常需要耐心，请抱着逆天的觉悟吧！……天使LV75，我方限制最高LV20。######
